//
//  Constants.swift
//  NagradaList
//
//  Created by Auto on 01.12.2025.
//

import Foundation

struct NagradaConstants {
    static let nagradaNames = [
        "Георгиевский крест после 1913 года",
        "Георгиевская медаль после 1913 года",
        "Знак отличия ордена святой Анны с 1864",
        "Знак отличия ордена святой Анны до 1864",
        "Георгиевская медаль до 1913",
        "Георгиевский крест до 1856",
        "Георгиевский крест до 1913",
        "Георгиевский крест для нехристиан",
        "Союзникам за войну 1812 года с вензелем Александра I",
        "Знак отличия 1-го кубанского ледяного похода",
        "Знак отличия за степной поход",
        "Георгиевский крест с 2008"
    ]
    
    static let nagradaShortNames = [
        "ГК", "ГМ", "Св. Анна с 1864", "Св. Анна до 1864",
        "ГМ до 1913", "ГК до 1856", "ГК до 1913", "ГК для нехристиан",
        "Союзникам за войну 1812", "Куб. ледяной", "Степной", "ГК с 2008"
    ]
    
    static let requiredFields = [
        "Кампания", "Вид", "Номер", "Степень", "Фамилия", "Имя", "Отчество",
        "Часть", "Подразделение1", "Подразделение2", "Чин", "Должность",
        "Отличие", "Комментарий", "Приказ", "Номер приказа", "Дата приказа",
        "Отношение", "Номер отношения", "Дата отношения", "Архив", "Фонд",
        "Дело", "Опись", "Лист", "Другие источники", "Служебные отметки"
    ]
}


